
public class repeat {
	public static void main(String[] args) {
		// System.out.println("출력");	// "출력"을 출력하라.
		
		// 조건문 :: if-else if-else문, switch문
		// 조건문1을 만족하면? -> if 내용만 수행하고 끝남
		// 조건문1을 만족하지 못하면? -> else if 또는 else로 토스됨
//		if(조건문1) {		// "조건문1"을 만족하면,
//			여기에 있는 내용을 수행하라.
//		}
//		else if(조건문2){ // 위 조건문을 만족하지 못하고, "조건문2"를 만족할 때
//			여기에 있는 내용을 수행하라.
//		}
//		else {	// 위 조건문을 모두 만족하지 못하였다면,
//			이거라도 수행해라.
//		}
		
		// 반복문 :: (조건을 만족한다는 전제 하)동일한 명령문을 반복하는 구문
		// "for문, while문", do-while문
//		while(조건문) {
//			조건문 만족할 시, 반복할 명령문
//		}
		
		// for문에 있어, 조건문 빼고는 모두 생략 가능
//		for(조건문 판별 이전 사전작업; 조건문; 루프완료시 후처리) {
//			반복할 명령문
//		}
	}
}
